import React, {useReducer, useState} from 'react';

let dataLinks = [
    {
        "Город": "Астрахань",
        "Поддомен": "astrakhan.займ-птс.рус",
        "адреса": "Богдана Хмельницкого ул, д. 36",
        "undefined": "в Астрахани"
    },
    {
        "Город": "Белгород",
        "Поддомен": "belgorod.займ-птс.рус",
        "адреса": "Михайловское ш, д. 31",
        "undefined": "в Белгороде"
    },
    {
        "Город": "Старый Оскол",
        "Поддомен": "staryyoskol.займ-птс.рус",
        "адреса": "Солнечный мкр, д. 36",
        "undefined": "в Старом Осколе"
    },
    {
        "Город": "Брянск",
        "Поддомен": "bryansk.займ-птс.рус",
        "адреса": "Литейная ул, д. 68",
        "undefined": "в Брянске"
    },
    {
        "Город": "Волгоград",
        "Поддомен": "volgograd.займ-птс.рус",
        "адреса": "Чехова ул, д. 18",
        "undefined": "в Волгограде"
    },
    {
        "Город": "Волжский",
        "Поддомен": "volzhskiy.займ-птс.рус",
        "адреса": "просп. Ленина, 326 Г",
        "undefined": "в Волжском"
    },
    {
        "Город": "Владимир",
        "Поддомен": "vladimir.займ-птс.рус",
        "адреса": "Горького ул, д. 65",
        "undefined": "в Владимире"
    },
    {
        "Город": "Великий Новгород",
        "Поддомен": "velikiynovgorod.займ-птс.рус",
        "адреса": "Стратилатовская ул, д. 5",
        "undefined": "в Великом Новгороде"
    },
    {
        "Город": "Воронеж",
        "Поддомен": "voronezh.займ-птс.рус",
        "адреса": "Фридриха Энгельса ул, д. 25б",
        "undefined": "в Воронеже"
    },
    {
        "Город": "Вологда",
        "Поддомен": "vologda.займ-птс.рус",
        "адреса": "Чехова ул, д. 18",
        " undefined": "в Вологде"
    },
    {
        "Город": "Череповец",
        "Поддомен": "cherepovets.займ-птс.рус",
        "адреса": "пер. Ухтомского, 5",
        "undefined": "в Череповце"
    },
    {
        "Город": "Дзержинск",
        "Поддомен": "dzerzhinsk.займ-птс.рус",
        "адреса": "Красноармейская ул, д. 21",
        "undefined": "в Дзержинске"
    },
    {
        "Город": "Нижний Новгород",
        "Поддомен": "nizhniynovgorod.займ-птс.рус",
        "адреса": "ул.Рождественская, 13, 2 этаж, 3 офис",
        "undefined": "в Нижнем Новгороде"
    },
    {
        "Город": "Кемерово",
        "Поддомен": "kemerovo.займ-птс.рус",
        "адреса": "ул. Пирогова, 32",
        "undefined": "в Кемерово"
    },
    {
        "Город": "Новокузнецк",
        "Поддомен": "novokuznetsk.займ-птс.рус",
        "адреса": "Ленина пр-кт, д. 7",
        "undefined": "в Новокузнецке"
    },
    {
        "Город": "Прокопьевск",
        "Поддомен": "prokopyevsk.займ-птс.рус",
        "адреса": "Ноградская ул., 28-а",
        "undefined": "в Прокопьевске"
    },
    {
        "Город": "Краснодар",
        "Поддомен": "krasnodar.займ-птс.рус",
        "адреса": "Северная, 490, БЦ Кутузовский, 1 этаж",
        "undefined": "в Краснодаре"
    },
    {
        "Город": "Сочи",
        "Поддомен": "sochi.займ-птс.рус",
        "адреса": "Кубанская ул, д. 15",
        "undefined": "в Сочи"
    },
    {
        "Город": "Армавир",
        "Поддомен": "armavir.займ-птс.рус",
        "адреса": "Мира ул, д. 24",
        "undefined": "в Армавире"
    },
    {
        "Город": "Новороссийск",
        "Поддомен": "novorossiysk.займ-птс.рус",
        "адреса": "Пр-кт Дзержинского 183 (вход со стороны ул. Дзержинского)",
        "undefined": "в Новороссийске"
    },
    {
        "Город": "Курск",
        "Поддомен": "kursk.займ-птс.рус",
        "адреса": "Кулакова пр-кт, д. 24",
        "undefined": "в Курске"
    },
    {
        "Город": "Ставрополь",
        "Поддомен": "stavropol.займ-птс.рус",
        "адреса": "Ул. Доваторцев 49Б (на 2 этаже над сбербанком)",
        "undefined": "в Ставрополе"
    },
    {
        "Город": "Курган",
        "Поддомен": "kurgan.займ-птс.рус",
        "адреса": "Машиностроителей пр-кт, д. 3в",
        "undefined": "в Кургане"
    },
    {
        "Город": "Чита",
        "Поддомен": "chita.займ-птс.рус",
        "адреса": "ул. Мостовая, 3",
        "undefined": "в Чите"
    },
    {
        "Город": "Красноярск",
        "Поддомен": "krasnoyarsk.займ-птс.рус",
        "адреса": "Вильского ул, д. 22",
        "undefined": "в Красноярске"
    },
    {
        "Город": "Норильск",
        "Поддомен": "norilsk.займ-птс.рус",
        "адреса": "Молодежный проезд, д. 3",
        "undefined": "в Норильске"
    },
    {
        "Город": "Кострома",
        "Поддомен": "kostroma.займ-птс.рус",
        "адреса": "Калиновская ул, д. 56",
        "undefined": "в Костроме"
    },
    {
        "Город": "Киров",
        "Поддомен": "kirov.займ-птс.рус",
        "адреса": "Комсомольская ул, д. 50",
        "undefined": "в Кирове"
    },
    {
        "Город": "Чебоксары",
        "Поддомен": "cheboksary.займ-птс.рус",
        "адреса": "ул. Энгельса, 28",
        "undefined": "в Чебоксарах"
    },
    {
        "Город": "Москва",
        "Поддомен": "moskva.займ-птс.рус",
        "адреса": "улица Ленинская Слобода, 19, 3 этаж, офис 3,034 (БЦ Омега Плаза)",
        "undefined": "в Москве"
    },
    {
        "Город": "Балашиха",
        "Поддомен": "balashikha.займ-птс.рус",
        "адреса": "Фадеева ул, д. 5",
        "undefined": "в Балашихе"
    },
    {
        "Город": "Электросталь",
        "Поддомен": "elektrostal.займ-птс.рус",
        "адреса": "Красная ул, д. 30б",
        "undefined": "в Электростали"
    },
    {
        "Город": "Химки",
        "Поддомен": "khimki.займ-птс.рус",
        "адреса": "Московская ул, д. 3",
        "undefined": "в Химках"
    },
    {
        "Город": "Красногорск",
        "Поддомен": "krasnogorsk.займ-птс.рус",
        "адреса": "Железнодорожный пер, д. 3",
        "undefined": "в Красногорске"
    },
    {
        "Город": "Мытищи",
        "Поддомен": "mytishchi.займ-птс.рус",
        "адреса": "Осташковское ш, д. 1",
        "undefined": "в Мытищях"
    },
    {
        "Город": "Королёв",
        "Поддомен": "korolev.займ-птс.рус",
        "адреса": "Карла Маркса ул, д. 3",
        "undefined": "в Королёве"
    },
    {
        "Город": "Подольск",
        "Поддомен": "podolsk.займ-птс.рус",
        "адреса": "Большая Серпуховская ул, д. 30",
        "undefined": "в Подольске"
    },
    {
        "Город": "Люберцы",
        "Поддомен": "lyubertsy.займ-птс.рус",
        "адреса": "Волковская ул, д. 11",
        "undefined": "в Люберцах"
    },
    {
        "Город": "Саратов",
        "Поддомен": "saratov.займ-птс.рус",
        "адреса": "Симбирская ул, д. 154",
        "undefined": "в Саратове"
    },
    {
        "Город": "Балаково",
        "Поддомен": "balakovo.займ-птс.рус",
        "адреса": "ул. Минская, д.56",
        "undefined": "в Балаково"
    },
    {
        "Город": "Энгельс",
        "Поддомен": "engels.займ-птс.рус",
        "адреса": "Петровская ул, д. 63",
        "undefined": "в Энгельсе"
    },
    {
        "Город": "Южно-Сахалинск",
        "Поддомен": "yuzhnosakhalinsk.займ-птс.рус",
        "адреса": "пр. Мира, 239",
        "undefined": "в Южно-Сахалинске"
    },
    {
        "Город": "Якутск",
        "Поддомен": "yakutsk.займ-птс.рус",
        "адреса": "Вилюйский тракт, 1",
        "undefined": "в Якутске"
    },
    {
        "Город": "Санкт-Петербург",
        "Поддомен": "sanktpeterburg.займ-птс.рус",
        "адреса": "Пр-кт Маршала Блюхера 12 корпус 7, офис 1.1. (станция метро Лесная)",
        "undefined": "в Санкт-Петербурге"
    },
    {
        "Город": "Сыктывкар",
        "Поддомен": "syktyvkar.займ-птс.рус",
        "адреса": "Интернациональная ул, д. 157",
        "undefined": "в Сыктывкаре"
    },
    {
        "Город": "Томск",
        "Поддомен": "tomsk.займ-птс.рус",
        "адреса": "Фрунзе пр-кт, д. 124",
        "undefined": "в Томске"
    },
    {
        "Город": "Ульяновск",
        "Поддомен": "ulianovsk.займ-птс.рус",
        "адреса": "Краснопролетарская ул, д. 16",
        "undefined": "в Ульяновске"
    },
    {
        "Город": "Улан-Удэ",
        "Поддомен": "ulan-ude.займ-птс.рус",
        "адреса": "34, ул. Бабушкина",
        "undefined": "в Улан-Удэ"
    },
    {
        "Город": "Тюмень",
        "Поддомен": "tyumen.займ-птс.рус",
        "адреса": "Локомотивная ул, д. 116/2",
        "undefined": "в Тюмене"
    },
    {
        "Город": "Тула",
        "Поддомен": "tula.займ-птс.рус",
        "адреса": "Красноармейский пр-кт, д. 11а",
        "undefined": "в Туле"
    },
    {
        "Город": "Самара",
        "Поддомен": "samara.займ-птс.рус",
        "адреса": "Лазо ул, д. 14",
        "undefined": "в Самаре"
    },
    {
        "Город": "Сызрань",
        "Поддомен": "syzran.займ-птс.рус",
        "адреса": "Ул. Гагарина 104 (жилой дом офис рядом с нотариусом)",
        "undefined": "в Сызрани"
    },
    {
        "Город": "Тольятти",
        "Поддомен": "toliatti.займ-птс.рус",
        "адреса": "Революционная ул, д. 18а",
        "undefined": "в Тольятти"
    },
    {
        "Город": "Салават",
        "Поддомен": "salavat.займ-птс.рус",
        "адреса": "Монтажников б-р, д. 48/2",
        "undefined": "в Салавате"
    },
    {
        "Город": "Стерлитамак",
        "Поддомен": "sterlitamak.займ-птс.рус",
        "адреса": "Коммунистическая ул, д. 84",
        "undefined": "в Стерлитамаке"
    },
    {
        "Город": "Уфа",
        "Поддомен": "ufa.займ-птс.рус",
        "адреса": "ул Бакалинская 25",
        "undefined": "в Уфе"
    },
    {
        "Город": "Саранск",
        "Поддомен": "saransk.займ-птс.рус",
        "адреса": "Веселовского ул, д. 31",
        "undefined": "в Саранске"
    },
    {
        "Город": "Хабаровск",
        "Поддомен": "khabarovsk.займ-птс.рус",
        "адреса": "Большая ул, д. 2а",
        "undefined": "в Хабаровске"
    },
    {
        "Город": "Нижневартовск",
        "Поддомен": "nizhnevartovsk.займ-птс.рус",
        "адреса": "Северная ул., 19",
        "undefined": "в Нижневартовске"
    },
    {
        "Город": "Северодвинск",
        "Поддомен": "severodvinsk.займ-птс.рус",
        "адреса": "ул. Ломоносова, 71 А",
        "undefined": "в Северодвинске"
    },
    {
        "Город": "Архангельск",
        "Поддомен": "arkhangelsk.займ-птс.рус",
        "адреса": "Московский пр-кт, д. 25",
        "undefined": "в Архангельске"
    },
    {
        "Город": "Ярославль",
        "Поддомен": "yaroslavl.займ-птс.рус",
        "адреса": "Толбухина пр-кт, д. 8/75",
        "undefined": "в Ярославле"
    },
    {
        "Город": "Рыбинск",
        "Поддомен": "rybinsk.займ-птс.рус",
        "адреса": "Герцена ул, д. 48а",
        "undefined": "в Рыбинске"
    },
    {
        "Город": "Рязань",
        "Поддомен": "ryazan.займ-птс.рус",
        "адреса": "Маяковского ул, д. 1а",
        "undefined": "в Рязани"
    },
    {
        "Город": "Псков",
        "Поддомен": "pskov.займ-птс.рус",
        "адреса": "Яна Фабрициуса ул, д. 10",
        "undefined": "в Пскове"
    },
    {
        "Город": "Тверь",
        "Поддомен": "tver.займ-птс.рус",
        "адреса": "Софьи Перовской ул, д. 28",
        "undefined": "в Твери"
    },
    {
        "Город": "Тамбов",
        "Поддомен": "tambov.займ-птс.рус",
        "адреса": "Советская ул, д. 125",
        "undefined": "в Тамбове"
    },
    {
        "Город": "Липецк",
        "Поддомен": "lipetsk.займ-птс.рус",
        "адреса": "Победы пр-кт, д. 29",
        "undefined": "в Липецке"
    },
    {
        "Город": "Мурманск",
        "Поддомен": "murmansk.займ-птс.рус",
        "адреса": "Ленина пр-кт, д. 82",
        "undefined": "в Мурманске"
    },
    {
        "Город": "Новосибирск",
        "Поддомен": "novosibirsk.займ-птс.рус",
        "адреса": "ул. Коммунистическая 27/29",
        "undefined": "в Новосибирске"
    },
    {
        "Город": "Омск",
        "Поддомен": "omsk.займ-птс.рус",
        "адреса": "Серова ул, д. 19а",
        "undefined": "в Омске"
    },
    {
        "Город": "Иваново",
        "Поддомен": "ivanovo.займ-птс.рус",
        "адреса": "Ленина пр-кт, д. 108",
        "undefined": "в Иваново"
    },
    {
        "Город": "Челябинск",
        "Поддомен": "chelyabinsk.займ-птс.рус",
        "адреса": "Университетская Набережная ул, д. 66б",
        "undefined": "в Челябинске"
    },
    {
        "Город": "Златоуст",
        "Поддомен": "zlatoust.займ-птс.рус",
        "адреса": "40-летия Победы ул, д. 20",
        "undefined": "в Златоусте"
    },
    {
        "Город": "Магнитогорск",
        "Поддомен": "magnitogorsk.займ-птс.рус",
        "адреса": "Ленина пр-кт, д. 139",
        "undefined": "в Магнитогорске"
    },
    {
        "Город": "Миасс",
        "Поддомен": "miass.займ-птс.рус",
        "адреса": "Октября пр-кт, д. 21",
        "undefined": "в Миассе"
    },
    {
        "Город": "Екатеринбург",
        "Поддомен": "ekaterinburg.займ-птс.рус",
        "адреса": "Ул. Ленина 25 ТЦ Европа 4 этаж оф 106 (вход через вторую дверь \"вертушкой\")",
        "undefined": "в Екатеринбурге"
    },
    {
        "Город": "Нижний Тагил",
        "Поддомен": "nizhniytagil.займ-птс.рус",
        "адреса": "Строителей пр-кт, д. 16",
        "undefined": "в Нижнем Тагиле"
    },
    {
        "Город": "Каменск-Уральский",
        "Поддомен": "kamensk-uralskiy.займ-птс.рус",
        "адреса": "Кутузова ул, д. 27",
        "undefined": "в Каменске-Уральском"
    },
    {
        "Город": "Оренбург",
        "Поддомен": "orenburg.займ-птс.рус",
        "адреса": "Дзержинского пр-кт, д. 4",
        "undefined": "в Оренбурге"
    },
    {
        "Город": "Орск",
        "Поддомен": "orsk.займ-птс.рус",
        "адреса": "Мира пр-кт, д. 7",
        "undefined": "в Орске"
    },
    {
        "Город": "Орёл",
        "Поддомен": "orel.займ-птс.рус",
        "адреса": "ул. Михалицина, 61",
        "undefined": "в Орле"
    },
    {
        "Город": "Калуга",
        "Поддомен": "kaluga.займ-птс.рус",
        "адреса": "Гагарина ул, д. 4",
        "undefined": "в Калуге"
    },
    {
        "Город": "Калининград",
        "Поддомен": "kaliningrad.займ-птс.рус",
        "адреса": "А.Невского ул, д. 193а",
        "undefined": "в Калининграде"
    },
    {
        "Город": "Благовещенск",
        "Поддомен": "blagoveshchensk.займ-птс.рус",
        "адреса": "Октябрьская ул, д. 173/1",
        "undefined": "в Благовещенске"
    },
    {
        "Город": "Пермь",
        "Поддомен": "perm.займ-птс.рус",
        "адреса": "ул. Петропаловская 41 оф 204",
        "undefined": "в Перми"
    },
    {
        "Город": "Пенза",
        "Поддомен": "penza.займ-птс.рус",
        "адреса": "Чехова ул, д. 3б",
        "undefined": "в Пензе"
    },
    {
        "Город": "Находка",
        "Поддомен": "nakhodka.займ-птс.рус",
        "адреса": "Находкинский пр-кт, д. 12",
        "undefined": "в Находке"
    },
    {
        "Город": "Уссурийск",
        "Поддомен": "ussuriysk.займ-птс.рус",
        "адреса": "ул. Ленина, 122",
        "undefined": "в Уссурийске"
    },
    {
        "Город": "Петропавловск-Камчатский",
        "Поддомен": "petropavlovsk-kamchatskiy.займ-птс.рус",
        "адреса": "50 Лет Октября просп",
        "undefined": "в Петропавловске-Камчатском"
    },
    {
        "Город": "Петрозаводск",
        "Поддомен": "petrozavodsk.займ-птс.рус",
        "адреса": "Ленина пр-кт, д. 15",
        "undefined": "в Петрозаводске"
    },
    {
        "Город": "Смоленск",
        "Поддомен": "smolensk.займ-птс.рус",
        "адреса": "Кловская ул, д. 19а",
        "undefined": "в Смоленске"
    },
    {
        "Город": "Барнаул",
        "Поддомен": "barnaul.займ-птс.рус",
        "адреса": "Антона Петрова ул, д. 170",
        "undefined": "в Барнауле"
    },
    {
        "Город": "Бийск",
        "Поддомен": "biysk.займ-птс.рус",
        "адреса": "Вали Максимовой ул, д. 85/1",
        "undefined": "в Бийске"
    },
    {
        "Город": "Иркутск",
        "Поддомен": "irkutsk.займ-птс.рус",
        "адреса": "Советская ул, д. 136",
        "undefined": "в Иркутске"
    },
    {
        "Город": "Ангарск",
        "Поддомен": "angarsk.займ-птс.рус",
        "адреса": "86-й кв-л, 1",
        "undefined": "в Ангарске"
    },
    {
        "Город": "Братск",
        "Поддомен": "bratsk.займ-птс.рус",
        "адреса": "ул. Наймушина, 4",
        "undefined": "в Братске"
    },
    {
        "Город": "Севастополь",
        "Поддомен": "sevastopol.займ-птс.рус",
        "адреса": "ул. Парковая, 29",
        "undefined": "в Севастополе"
    },
    {
        "Город": "Симферополь",
        "Поддомен": "simferopol.займ-птс.рус",
        "адреса": "ул. Маяковского, 14",
        "undefined": "в Симферополе"
    },
    {
        "Город": "Нальчик",
        "Поддомен": "nalchik.займ-птс.рус",
        "адреса": "ул. Ногмова, 75",
        "undefined": "в Нальчике"
    },
    {
        "Город": "Казань",
        "Поддомен": "kazan.займ-птс.рус",
        "адреса": "ул.Пушкина 30, 2 этаж, офис 211",
        "undefined": "в Казани"
    },
    {
        "Город": "Альметьевск",
        "Поддомен": "almetyevsk.займ-птс.рус",
        "адреса": "Ленина ул, д. 60",
        "undefined": "в Альметьевске"
    },
    {
        "Город": "Нижнекамск",
        "Поддомен": "nizhnekamsk.займ-птс.рус",
        "адреса": "Южная ул, д. 3",
        "undefined": "в Нижнекамске"
    },
    {
        "Город": "Набережные челны",
        "Поддомен": "naberezhnyyechelny.займ-птс.рус",
        "адреса": "Мира пр-кт, д. 8а",
        "undefined": "в Набережных челнах"
    },
    {
        "Город": "Абакан",
        "Поддомен": "abakan.займ-птс.рус",
        "адреса": "Тараса Шевченко ул, д. 62",
        "undefined": "в Абакане"
    },
    {
        "Город": "Йошкар-Ола",
        "Поддомен": "yoshkar-ola.займ-птс.рус",
        "адреса": "Комсомольская ул, д. 79",
        "undefined": "в Йошкар-Оле"
    },
    {
        "Город": "Ижевск",
        "Поддомен": "izhevsk.займ-птс.рус",
        "адреса": "Воткинское шоссе, 162, оф.18",
        "undefined": "в Ижевске"
    },
    {
        "Город": "Ростов-на-Дону",
        "Поддомен": "rostov-na-donu.займ-птс.рус",
        "адреса": "Ул. Ленина 54, (рядом салон красоты \"Светлана\")",
        "undefined": "в Ростове-на-Дону"
    },
    {
        "Город": "Волгодонск",
        "Поддомен": "volgodonsk.займ-птс.рус",
        "адреса": "Ленина ул, д. 45",
        "undefined": "в Волгодонске"
    },
    {
        "Город": "Аксай",
        "Поддомен": "aksay.займ-птс.рус",
        "адреса": "пр. Ленина, 24",
        "undefined": "в Аксае"
    },
    {
        "Город": "Батайск",
        "Поддомен": "bataysk.займ-птс.рус",
        "адреса": "Ул. Максима Горького 285Г",
        "undefined": "в Батайске"
    },
    {
        "Город": "Шахты",
        "Поддомен": "shakhty.займ-птс.рус",
        "адреса": "Победа Революции пр-т., 188",
        "undefined": "в Шахтах"
    },
    {
        "Город": "Таганрог",
        "Поддомен": "taganrog.займ-птс.рус",
        "адреса": "ул. Москатова, 10-1",
        "undefined": "в Таганроге"
    },
    {
        "Город": "Новочеркасск",
        "Поддомен": "novocherkassk.займ-птс.рус",
        "адреса": "Новочеркасское шоссе 1А (поворот на грушевку)",
        "undefined": "в Новочеркасске"
    },
    {
        "Город": "Владивосток",
        "Поддомен": "vladivostok.займ-птс.рус",
        "адреса": "ул. Батарейная, 3а, офис 310",
        "undefined": "в Владивостоке"
    },
    {
        "Город": "Сургут",
        "Поддомен": "surgut.займ-птс.рус",
        "адреса": "ул. Игоря Киртбая, 11",
        "undefined": "в Сургуте"
    },
    {
        "Город": "Керчь",
        "Поддомен": "kerch.займ-птс.рус",
        "адреса": "улица Ленина, 45",
        "undefined": "в Керчи"
    },
    {
        "Город": "Пятигорск",
        "Поддомен": "pyatigorsk.займ-птс.рус",
        "адреса": "улица Ермолова, 28с2",
        "undefined": "в Пятигорске"
    },
    {
        "Город": "Копейск",
        "Поддомен": "kopeysk.займ-птс.рус",
        "адреса": "проспект Ильича, 13",
        "undefined": "в Копейске"
    },
    {
        "Город": "Рубцовск",
        "Поддомен": "rubtsovsk.займ-птс.рус",
        "адреса": "Комсомольская улица, 257",
        "undefined": "в Рубцовске"
    },
    {
        "Город": "Майкоп",
        "Поддомен": "maykop.займ-птс.рус",
        "адреса": "Краснооктябрьская ул., 50",
        "undefined": "в Майкопе"
    },
    {
        "Город": "Коломна",
        "Поддомен": "kolomna.займ-птс.рус",
        "адреса": "проспект Кирова, 28А/2",
        "undefined": "в Коломне"
    },
    {
        "Город": "Березники",
        "Поддомен": "berezniki.займ-птс.рус",
        "адреса": "улица Карла Маркса, 53",
        "undefined": "в Березниках"
    },
    {
        "Город": "Домодедово",
        "Поддомен": "domodedovo.займ-птс.рус",
        "адреса": "улица Кирова, с28",
        "undefined": "в Домодедово"
    },
    {
        "Город": "Ковров",
        "Поддомен": "kovrov.займ-птс.рус",
        "адреса": "проспект Ленина, 35",
        "undefined": "в Коврове"
    },
    {
        "Город": "Одинцово",
        "Поддомен": "odintsovo.займ-птс.рус",
        "адреса": "Можайское ш., 71 ТЦ Дубрава",
        "undefined": "в Одинцово"
    },
    {
        "Город": "Нефтекамск",
        "Поддомен": "neftekamsk.займ-птс.рус",
        "адреса": "улица Ленина, 46",
        "undefined": "в Нефтекамске"
    },
    {
        "Город": "Кисловодск",
        "Поддомен": "kislovodsk.займ-птс.рус",
        "адреса": "улица Тельмана, 5",
        "undefined": "в Кисловодске"
    },
    {
        "Город": "Нефтеюганск",
        "Поддомен": "nefteyugansk.займ-птс.рус",
        "адреса": "5-й микрорайон, 6",
        "undefined": "в Нефтеюганске"
    },
    {
        "Город": "Новочебоксарск",
        "Поддомен": "novocheboksarsk.займ-птс.рус",
        "адреса": "улица Семёнова, 37",
        "undefined": "в Новочебоксарске"
    },
    {
        "Город": "Щёлково",
        "Поддомен": "shchelkovo.займ-птс.рус",
        "адреса": "улица Комарова, 2",
        "undefined": "в Щёлково"
    },
    {
        "Город": "Новомосковск",
        "Поддомен": "novomoskovsk.займ-птс.рус",
        "адреса": "Комсомольская улица, 30",
        "undefined": "в Новомосковске"
    },
    {
        "Город": "Раменское",
        "Поддомен": "ramenskoye.займ-птс.рус",
        "адреса": "улица Карла Маркса, 6",
        "undefined": "в Раменском"
    },
    {
        "Город": "Первоуральск",
        "Поддомен": "pervouralsk.займ-птс.рус",
        "адреса": "улица Ватутина, 42",
        "undefined": "в Первоуральске"
    },
    {
        "Город": "Кызыл",
        "Поддомен": "kyzyl.займ-птс.рус",
        "адреса": "улица Кочетова, 53",
        "undefined": "в Кызыле"
    },
    {
        "Город": "Орехово-Зуево",
        "Поддомен": "orekhovozuyevo.займ-птс.рус",
        "адреса": "Центральный бульвар, 3",
        "undefined": "в Орехово-Зуеве"
    },
    {
        "Город": "Новый Уренгой",
        "Поддомен": "novyyurengoy.займ-птс.рус",
        "адреса": "Ленинградский проспект, 8",
        "undefined": "в Новом Уренгое"
    },
    {
        "Город": "Обнинск",
        "Поддомен": "obninsk.займ-птс.рус",
        "адреса": "проспект Маркса, 50",
        "undefined": "в Обнинске"
    },
    {
        "Город": "Невинномысск",
        "Поддомен": "nevinnomyssk.займ-птс.рус",
        "адреса": "улица Гагарина, 17",
        "undefined": "в Невинномысске"
    },
    {
        "Город": "Долгопрудный",
        "Поддомен": "dolgoprudnyy.займ-птс.рус",
        "адреса": "Дирижабельная улица, 9",
        "undefined": "в Долгопрудном"
    },
    {
        "Город": "Октябрьский",
        "Поддомен": "oktyabrskiy.займ-птс.рус",
        "адреса": "проспект Ленина, 10",
        "undefined": "в Октябрьском"
    },
    {
        "Город": "Димитровград",
        "Поддомен": "dimitrovgrad.займ-птс.рус",
        "адреса": "улица Хмельницкого, 112",
        "undefined": "в Димитровграде"
    },
    {
        "Город": "Ессентуки",
        "Поддомен": "essentuki.займ-птс.рус",
        "адреса": "Советская улица, 24",
        "undefined": "в Ессентуках"
    },
    {
        "Город": "Камышин",
        "Поддомен": "kamyshin.займ-птс.рус",
        "адреса": "Пролетарская улица, 70/1",
        "undefined": "в Камышине"
    },
    {
        "Город": "Евпатория",
        "Поддомен": "evpatoriya.займ-птс.рус",
        "адреса": "улица Пушкина, 16",
        "undefined": "в Евпатории"
    },
    {
        "Город": "Реутов",
        "Поддомен": "reutov.займ-птс.рус",
        "адреса": "улица Ленина, 14",
        "undefined": "в Реутове"
    },
    {
        "Город": "Жуковский",
        "Поддомен": "zhukovskiy.займ-птс.рус",
        "адреса": "улица Фрунзе, 9",
        "undefined": "в Жуковском"
    },
    {
        "Город": "Пушкино",
        "Поддомен": "pushkino.займ-птс.рус",
        "адреса": "Московский проспект, 6",
        "undefined": "в Пушкино"
    },
    {
        "Город": "Муром",
        "Поддомен": "murom.займ-птс.рус",
        "адреса": "Московская улица, 14",
        "undefined": "в Муроме"
    },
    {
        "Город": "Ноябрьск",
        "Поддомен": "noyabrsk.займ-птс.рус",
        "адреса": "улица Ленина, 42",
        "undefined": "в Ноябрьске"
    },
    {
        "Город": "Новошахтинск",
        "Поддомен": "novoshakhtinsk.займ-птс.рус",
        "адреса": "проспект Ленина, 7",
        "undefined": "в Новошахтинске"
    },
    {
        "Город": "Северск",
        "Поддомен": "seversk.займ-птс.рус",
        "адреса": "улица Ленина, 40",
        "undefined": "в Северске"
    },
    {
        "Город": "Артём",
        "Поддомен": "artem.займ-птс.рус",
        "адреса": "улица Фрунзе, 54Г",
        "undefined": "в Артёме"
    },
    {
        "Город": "Ачинск",
        "Поддомен": "achinsk.займ-птс.рус",
        "адреса": "9-й микрорайон, 11",
        "undefined": "в Ачинске"
    },
    {
        "Город": "Бердск",
        "Поддомен": "berdsk.займ-птс.рус",
        "адреса": "улица Островского, 57",
        "undefined": "в Бердске"
    },
    {
        "Город": "Ногинск",
        "Поддомен": "noginsk.займ-птс.рус",
        "адреса": "Советская улица, 44",
        "undefined": "в Ногинске"
    },
    {
        "Город": "Арзамас",
        "Поддомен": "arzamas.займ-птс.рус",
        "адреса": "Соборная площадь, 2А",
        "undefined": "в Арзамасе"
    },
    {
        "Город": "Элиста",
        "Поддомен": "elista.займ-птс.рус",
        "адреса": "улица А. Сусеева, 4",
        "undefined": "в Элисте"
    },
    {
        "Город": "Елец",
        "Поддомен": "elets.займ-птс.рус",
        "адреса": "улица Мира, 92",
        "undefined": "в Ельце"
    },
    {
        "Город": "Ханты-Мансийск",
        "Поддомен": "khantymansiysk.займ-птс.рус",
        "адреса": "улица Энгельса, 3",
        "undefined": "в Ханты-Мансийске"
    },
    {
        "Город": "Новокуйбышевск",
        "Поддомен": "novokuybyshevsk.займ-птс.рус",
        "адреса": "Коммунистическая улица, 39",
        "undefined": "в Новокуйбышевске"
    },
    {
        "Город": "Железногорск",
        "Поддомен": "zheleznogorsk.займ-птс.рус",
        "адреса": "улица Ленина, 48к1",
        "undefined": "в Железногорске"
    },
    {
        "Город": "Сергиев Посад",
        "Поддомен": "sergiyevposad.займ-птс.рус",
        "адреса": "проспект Красной Армии, 131",
        "undefined": "в Сергиевом Посаде"
    },
    {
        "Город": "Зеленодольск",
        "Поддомен": "zelenodolsk.займ-птс.рус",
        "адреса": "улица Ленина, 21",
        "undefined": "в Зеленодольске"
    }
]
let dataA = dataLinks.filter(el => el['Город'][0] === 'А')
let dataБ = dataLinks.filter(el => el['Город'][0] === 'Б')
let dataВ = dataLinks.filter(el => el['Город'][0] === 'В')
let dataГ = dataLinks.filter(el => el['Город'][0] === 'Г')
let dataД = dataLinks.filter(el => el['Город'][0] === 'Д')
let dataЕ = dataLinks.filter(el => el['Город'][0] === 'Е')
let dataЁ = dataLinks.filter(el => el['Город'][0] === 'Ё')
let dataЖ = dataLinks.filter(el => el['Город'][0] === 'Ж')
let dataЗ = dataLinks.filter(el => el['Город'][0] === 'З')
let dataИ = dataLinks.filter(el => el['Город'][0] === 'И')
let dataЙ = dataLinks.filter(el => el['Город'][0] === 'Й')
let dataК = dataLinks.filter(el => el['Город'][0] === 'К')
let dataЛ = dataLinks.filter(el => el['Город'][0] === 'Л')
let dataМ = dataLinks.filter(el => el['Город'][0] === 'М')
let dataН = dataLinks.filter(el => el['Город'][0] === 'Н')
let dataО = dataLinks.filter(el => el['Город'][0] === 'О')
let dataП = dataLinks.filter(el => el['Город'][0] === 'П')
let dataР = dataLinks.filter(el => el['Город'][0] === 'Р')
let dataС = dataLinks.filter(el => el['Город'][0] === 'С')
let dataТ = dataLinks.filter(el => el['Город'][0] === 'Т')
let dataУ = dataLinks.filter(el => el['Город'][0] === 'У')
let dataФ = dataLinks.filter(el => el['Город'][0] === 'Ф')
let dataХ = dataLinks.filter(el => el['Город'][0] === 'Х')
let dataЦ = dataLinks.filter(el => el['Город'][0] === 'Ц')
let dataЧ = dataLinks.filter(el => el['Город'][0] === 'Ч')
let dataШ = dataLinks.filter(el => el['Город'][0] === 'Ш')
let dataЩ = dataLinks.filter(el => el['Город'][0] === 'Щ')
let dataЭ = dataLinks.filter(el => el['Город'][0] === 'Э')
let dataЮ = dataLinks.filter(el => el['Город'][0] === 'Ю')
let dataЯ = dataLinks.filter(el => el['Город'][0] === 'Я')


export const reducer = (stateCity, action) => {
    switch (action.type){
        case 'changeCity' : {
            console.log(stateCity.city)
            return {
                city: action.payload
            }
        }
        default : {
            return stateCity
        }
    }
}

export const Goroda = () => {
    const [stateCity,dispatch] = useReducer(reducer, {
        city: 'В Москве'
    })

    function changeCity(city){
        dispatch({
            type: 'changeCity',
            payload: city
        })
    }
    console.log(stateCity.city)


    return (
        <div className={'row'}>
            <div className={'col-sm-12 col-md-3'}>
                <div className='letter'>А</div>
                <div>
                    {
                        dataA.map(el => {
                            return (
                                <ul onClick={() => {changeCity('Питер')}} className='cities-ul' itemScope='itemscope'
                                    itemType="http://schema.org/SiteNavigationElement">
                                    <li className='cities-li'><div className="cities-a " itemprop='url'
                                                                 href={el['Поддомен']}> {el["Город"]}
                                    </div></li>
                                </ul>
                            )
                        })
                    }
                </div>
            </div>
        </div>
    );
};
